In [1]:
import pandas as pd

In [2]:
pd.read_csv(r"C:\Users\Vishal\OneDrive\Desktop\new data.csv")

   ID First Name    Last Name     Role  Salary  Location
0   1     Atharv        Pawar       DA   45000      Pune
1   2     Chetan       Chavan       DA   43000      Pune
2   3     Sanika      Shendge       DS   46000    Mumbai
3   4      Kabir       Chavan       PD   48000      Pune
4   5    Pallavi       Pujari       JD   49000  Bengluru
5   6     Suhana      Mujawar  Manager   50000    sangli
6   7   Vishakha        Patil  Manager   55000  Hydrabad
7   8   Vaishali       Rupnar       QA   40000    Mumbai
8   9   Sanandan  Pandharpure       QA   42000  Kolhapur
9  10     kartik      Gaikwad       TL   47000    Mumbai

In [3]:
pd.read_csv(r"C:\Users\Vishal\OneDrive\Desktop\Account Tally Session 1.csv")

                                                   F4    CONTRA
0                    CASH/BANK IS DEBITED OR CREDITED        NaN
1                              CASH DEPOSITED IN BANK        NaN
2                           CASH WITHDRAWAL FROM BANK        NaN
3                                INTER BANK TRANSFER         NaN
4                                 INTER CASH TRANSFER        NaN
5                                                 NaN        NaN
6                                                  F5    PAYMENT
7                    CASH OR BANK ACCOUNT IS CREDITED        NaN
8                                                 NaN        NaN
9                                                  F6    RECEIPT
10                       CASH/BANK ACCOUNT IS DEBITED        NaN
11                                                NaN        NaN
12                                                 F7    JOURNAL
13  IN A TRANSACTION CASH/BANK IS NEITHER DEBITED ...        NaN
14                                                NaN        NaN
15                                                 F8      SALES
16                              FOR CASH/CREDIT SALES        NaN
17                                                NaN        NaN
18                                                 F9  PURCHASES
19                       FOR CASH OR CREDIT PURCHASES        NaN